
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version R-2020.09-SP2 for linux64 - Dec 03, 2020 

                    Copyright (c) 1988 - 2020 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
dc_shell> dc_shell> arx_numeric.vhd sec_nov.vhd
dc_shell> sec_nov_std
dc_shell> clock
dc_shell> none
dc_shell> 10
dc_shell> sec_nov_std_rtl_none_10
dc_shell> n
dc_shell> n
dc_shell> rtl_none_10
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Running PRESTO HDLC
Compiling Package Declaration ARX_NUMERIC
Compiling Package Body ARX_NUMERIC
Presto compilation completed successfully.
Loading db file '/remote/labware/technology/UMC/UMCL18U250D2_2.4/design_compiler/umcl18u250t2_typ.db'
Loading db file '/remote/labware/packages/synopsys/syn/R-2020.09-SP2/libraries/syn/dw_foundation.sldb'
Running PRESTO HDLC
Compiling Entity Declaration SEC_NOV_STD
Compiling Architecture RTL of SEC_NOV_STD
Warning:  ./sec_nov.vhd:18: The architecture rtl has already been analyzed. It is being replaced. (VHD-4)
Compiling Entity Declaration SEC_NOV
Compiling Architecture RTL of SEC_NOV
Warning:  ./sec_nov.vhd:61: The architecture rtl has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
dc_shell> dc_shell> dc_shell> dc_shell> Loading db file '/remote/labware/packages/synopsys/syn/R-2020.09-SP2/libraries/syn/gtech.db'
Loading db file '/remote/labware/packages/synopsys/syn/R-2020.09-SP2/libraries/syn/standard.sldb'
Warning: The library named umcl18u250t2_typ specifies a very small trip-point value (0). (TIM-163)
Warning: The library named umcl18u250t2_typ specifies a very small trip-point value (0). (TIM-163)
  Loading link library 'umcl18u250t2_typ'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully. (sec_nov_std)
Elaborated 1 design.
Current design is now 'sec_nov_std'.
Information: Building the design 'sec_nov'. (HDL-193)

Statistics for case statements in always block at line 114 in file
	'./sec_nov.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           168            |    auto/auto     |
|           203            |    auto/auto     |
|           240            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine sec_nov line 87 in file
		'./sec_nov.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|  arx_state_reg_reg  | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_i1_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_r1_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_r2_reg_reg    | Flip-flop |  15   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_r3_reg_reg    | Flip-flop |  15   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_r4_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_d0_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_d1_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_d2_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|   arx_o1_reg_reg    | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (sec_nov)
1
dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> Current design is 'sec_nov_std'.
Error: Cannot rename design /home/s2981416/map/vhdl/sec_nov_std.db:sec_nov_std over existing design /home/s2981416/map/vhdl/sec_nov_std.db:sec_nov_std. (UIMG-43)
0
dc_shell> dc_shell> dc_shell> dc_shell> FALSE
dc_shell> dc_shell> dc_shell> Information: Checking out the license 'DesignWare'. (SEC-104)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | R-2020.09-DWBB_202009.2 |     *     |
| Licensed DW Building Blocks        | R-2020.09-DWBB_202009.2 |     *     |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'sec_nov'
  Processing 'sec_nov_std'

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Implementation Selection
  ----------------------------------
  Processing 'sec_nov_DW01_add_0'
  Processing 'sec_nov_DW01_add_1'
  Mapping 'sec_nov_DW_mult_tc_0'

  Beginning Mapping Optimizations  (High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02   20315.9      0.00       0.0       0.0                          
    0:00:02   20315.9      0.00       0.0       0.0                          
    0:00:02   20315.9      0.00       0.0       0.0                          
    0:00:02   20315.9      0.00       0.0       0.0                          
    0:00:02   20315.9      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16522.4      0.00       0.0       0.0                          
    0:00:02   16506.2      0.00       0.0       0.0                          
    0:00:02   16485.8      0.00       0.0       0.0                          
    0:00:02   16477.7      0.00       0.0       0.0                          
    0:00:02   16469.6      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
    0:00:02   16461.4      0.00       0.0       0.0                          
Loading db file '/remote/labware/technology/UMC/UMCL18U250D2_2.4/design_compiler/umcl18u250t2_typ.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell>  
****************************************
check_design summary:
Version:     R-2020.09-SP2
Date:        Fri Mar  3 12:06:46 2023
****************************************

                   Name                                            Total
--------------------------------------------------------------------------------
Inputs/Outputs                                                      9
    Unconnected ports (LINT-28)                                     9
--------------------------------------------------------------------------------

Warning: In design 'sec_nov_DW01_add_1', port 'CI' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[5]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[4]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[3]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[2]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[1]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'SUM[0]' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW01_add_1', port 'CO' is not connected to any nets. (LINT-28)
Warning: In design 'sec_nov_DW_mult_tc_0', port 'product[15]' is not connected to any nets. (LINT-28)
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> NMA-16 VHDL-286 UCN-4
dc_shell> 1
dc_shell> 1
dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> hier_rtl_none_10
dc_shell> dc_shell> dc_shell> Writing vhdl file '/home/s2981416/map/vhdl/synopsys_out/sec_nov_std_rtl_none_10_hier.vhd'.
Warning: A dummy net 'n_1000' is created to connect open pin 'product(15)'. (VHDL-290)
Warning: A dummy net 'n_1001' is created to connect open pin 'CI'. (VHDL-290)
Warning: A dummy net 'n_1002' is created to connect open pin 'SUM(5)'. (VHDL-290)
Warning: A dummy net 'n_1003' is created to connect open pin 'SUM(4)'. (VHDL-290)
Warning: A dummy net 'n_1004' is created to connect open pin 'SUM(3)'. (VHDL-290)
Warning: A dummy net 'n_1005' is created to connect open pin 'SUM(2)'. (VHDL-290)
Warning: A dummy net 'n_1006' is created to connect open pin 'SUM(1)'. (VHDL-290)
Warning: A dummy net 'n_1007' is created to connect open pin 'SUM(0)'. (VHDL-290)
Warning: A dummy net 'n_1008' is created to connect open pin 'CO'. (VHDL-290)
Warning: A dummy net 'n_1009' is created to connect open pin 'CO'. (VHDL-290)
Warning: A dummy net 'n_1010' is created to connect open pin 'SUM(5)'. (VHDL-290)
Warning: A dummy net 'n_1011' is created to connect open pin 'SUM(4)'. (VHDL-290)
Warning: A dummy net 'n_1012' is created to connect open pin 'SUM(3)'. (VHDL-290)
Warning: A dummy net 'n_1013' is created to connect open pin 'SUM(2)'. (VHDL-290)
Warning: A dummy net 'n_1014' is created to connect open pin 'SUM(1)'. (VHDL-290)
Warning: A dummy net 'n_1015' is created to connect open pin 'SUM(0)'. (VHDL-290)
Warning: A dummy net 'n_1016' is created to connect open pin 'CO'. (VHDL-290)
Warning: A dummy net 'n_1017' is created to connect open pin 'product(15)'. (VHDL-290)
1
dc_shell> dc_shell> dc_shell>  
****************************************
Report : hierarchy
Design : sec_nov_std
Version: R-2020.09-SP2
Date   : Fri Mar  3 12:06:46 2023
****************************************

Attributes:
    r - licensed design

sec_nov_std
    sec_nov
        AND2D1                       umcl18u250t2_typ
        AND3D1                       umcl18u250t2_typ
        AOI22D1                      umcl18u250t2_typ
        DFERPQ1                      umcl18u250t2_typ
        DFFRPQ1                      umcl18u250t2_typ
        EXOR2D1                      umcl18u250t2_typ
        INVD1                        umcl18u250t2_typ
        NAN2D1                       umcl18u250t2_typ
        NAN3D1                       umcl18u250t2_typ
        NAN3M1D1                     umcl18u250t2_typ
        NAN4D1                       umcl18u250t2_typ
        NOR2D1                       umcl18u250t2_typ
        NOR2M1D1                     umcl18u250t2_typ
        OAI21M20D1                   umcl18u250t2_typ
        OAI22M10D1                   umcl18u250t2_typ
        OR2D1                        umcl18u250t2_typ
        TIELO                        umcl18u250t2_typ
        sec_nov_DW01_add_1
            ADFULD1                  umcl18u250t2_typ
            OAI21D1                  umcl18u250t2_typ
            OAI21M20D1               umcl18u250t2_typ
            OAI211D1                 umcl18u250t2_typ
        sec_nov_DW_mult_tc_0                   r
            ADFULD1                  umcl18u250t2_typ
            ADHALFDL                 umcl18u250t2_typ
            AO21D1                   umcl18u250t2_typ
            AOI22D1                  umcl18u250t2_typ
            EXNOR2D1                 umcl18u250t2_typ
            EXNOR3D1                 umcl18u250t2_typ
            EXOR2D1                  umcl18u250t2_typ
            INVD1                    umcl18u250t2_typ
            NAN2D1                   umcl18u250t2_typ
            NOR2D1                   umcl18u250t2_typ
            OAI21D1                  umcl18u250t2_typ
            OAI22D1                  umcl18u250t2_typ
            OAI22M10D1               umcl18u250t2_typ
            OAI32D1                  umcl18u250t2_typ
            OR2D1                    umcl18u250t2_typ
1
dc_shell> Information: Updating graph... (UID-83)
 
****************************************
Report : reference
Design : sec_nov_std
Version: R-2020.09-SP2
Date   : Fri Mar  3 12:06:46 2023
****************************************

Attributes:
    b - black box (unknown)
   bo - allows boundary optimization
    d - dont_touch
   mo - map_only
    h - hierarchical
    n - noncombinational
    r - removable
    s - synthetic operator
    u - contains unmapped logic

Reference          Library       Unit Area   Count    Total Area   Attributes
-----------------------------------------------------------------------------
sec_nov                       16461.449976       1  16461.449976  h, n
-----------------------------------------------------------------------------
Total 1 references                                  16461.449976

****************************************
Design: sec_nov 
****************************************
Reference          Library       Unit Area   Count    Total Area   Attributes
-----------------------------------------------------------------------------
AND2D1             umcl18u250t2_typ
                                 16.260000      12    195.120003  
AND3D1             umcl18u250t2_typ
                                 20.330000       5    101.650000  
AOI22D1            umcl18u250t2_typ
                                 24.389999       8    195.119995  
DFERPQ1            umcl18u250t2_typ
                                101.639999      86   8741.039948  n
DFFRPQ1            umcl18u250t2_typ
                                 81.309998       4    325.239990  n
EXOR2D1            umcl18u250t2_typ
                                 28.459999       8    227.679993  
INVD1              umcl18u250t2_typ
                                  8.130000      41    333.330005  
NAN2D1             umcl18u250t2_typ
                                 12.200000      15    182.999997  
NAN3D1             umcl18u250t2_typ
                                 16.260000       8    130.080002  
NAN3M1D1           umcl18u250t2_typ
                                 20.330000       1     20.330000  
NAN4D1             umcl18u250t2_typ
                                 20.330000       4     81.320000  
NOR2D1             umcl18u250t2_typ
                                 12.200000      17    207.399997  
NOR2M1D1           umcl18u250t2_typ
                                 16.260000       5     81.300001  
OAI21M20D1         umcl18u250t2_typ
                                 24.389999       8    195.119995  
OAI22M10D1         umcl18u250t2_typ
                                 32.520000      16    520.320007  
OR2D1              umcl18u250t2_typ
                                 16.260000       1     16.260000  
TIELO              umcl18u250t2_typ
                                  8.130000       1      8.130000  
sec_nov_DW01_add_1              813.110023       1    813.110023  h
sec_nov_DW_mult_tc_0           4085.900021       1   4085.900021  h
-----------------------------------------------------------------------------
Total 19 references                                 16461.449976

****************************************
Design: sec_nov_DW01_add_1 
****************************************
Reference          Library       Unit Area   Count    Total Area   Attributes
-----------------------------------------------------------------------------
ADFULD1            umcl18u250t2_typ
                                 65.050003       9    585.450027  r
OAI21D1            umcl18u250t2_typ
                                 20.330000       4     81.320000  
OAI21M20D1         umcl18u250t2_typ
                                 24.389999       5    121.949997  
OAI211D1           umcl18u250t2_typ
                                 24.389999       1     24.389999  
-----------------------------------------------------------------------------
Total 4 references                                    813.110023

****************************************
Design: sec_nov_DW_mult_tc_0 
****************************************
Reference          Library       Unit Area   Count    Total Area   Attributes
-----------------------------------------------------------------------------
ADFULD1            umcl18u250t2_typ
                                 65.050003      26   1691.300079  r
ADHALFDL           umcl18u250t2_typ
                                 40.660000       4    162.639999  r
AO21D1             umcl18u250t2_typ
                                 28.459999       3     85.379997  
AOI22D1            umcl18u250t2_typ
                                 24.389999       1     24.389999  
EXNOR2D1           umcl18u250t2_typ
                                 28.459999       5    142.299995  
EXNOR3D1           umcl18u250t2_typ
                                 52.849998       1     52.849998  
EXOR2D1            umcl18u250t2_typ
                                 28.459999      33    939.179970  
INVD1              umcl18u250t2_typ
                                  8.130000      10     81.300001  
NAN2D1             umcl18u250t2_typ
                                 12.200000       4     48.799999  
NOR2D1             umcl18u250t2_typ
                                 12.200000       4     48.799999  
OAI21D1            umcl18u250t2_typ
                                 20.330000       2     40.660000  
OAI22D1            umcl18u250t2_typ
                                 24.389999      26    634.139984  
OAI22M10D1         umcl18u250t2_typ
                                 32.520000       1     32.520000  
OAI32D1            umcl18u250t2_typ
                                 28.459999       3     85.379997  
OR2D1              umcl18u250t2_typ
                                 16.260000       1     16.260000  
-----------------------------------------------------------------------------
Total 15 references                                  4085.900021
1
dc_shell> dc_shell> dc_shell>  
****************************************
Report : resources
Design : sec_nov_std
Version: R-2020.09-SP2
Date   : Fri Mar  3 12:06:46 2023
****************************************


No resource sharing information to report.

No implementations to report
 
****************************************
Design : sec_nov
****************************************
Resource Sharing Report for design sec_nov in file ./sec_nov.vhd

===============================================================================
|          |              |            | Contained     |                      |
| Resource | Module       | Parameters | Resources     | Contained Operations |
===============================================================================
| r373     | DW01_add     | width=15   |               | add_239              |
| r375     | DW01_add     | width=8    |               | add_416_C239_rn      |
| r1091    | DW_mult_tc   | a_width=8  |               | mult_238             |
|          |              | b_width=8  |               |                      |
===============================================================================


Implementation Report
===============================================================================
|                    |                  | Current            | Set            |
| Cell               | Module           | Implementation     | Implementation |
===============================================================================
| mult_238           | DW_mult_tc       | apparch (area)     |                |
|                    |                  | mult_arch: benc_radix4              |
| add_239            | DW01_add         | rpl                |                |
===============================================================================

1
dc_shell> dc_shell> dc_shell> TRUE
dc_shell> Warning: Design 'sec_nov_std' inherited license information from design 'sec_nov_DW_mult_tc_0'. (DDB-74)
Information: Added key list 'DesignWare' to design 'sec_nov_std'. (DDB-72)
1
dc_shell> dc_shell> dc_shell>  
****************************************
Report : reference
Design : sec_nov_std
Version: R-2020.09-SP2
Date   : Fri Mar  3 12:06:46 2023
****************************************

Attributes:
    b - black box (unknown)
   bo - allows boundary optimization
    d - dont_touch
   mo - map_only
    h - hierarchical
    n - noncombinational
    r - removable
    s - synthetic operator
    u - contains unmapped logic

Reference          Library       Unit Area   Count    Total Area   Attributes
-----------------------------------------------------------------------------
ADFULD1            umcl18u250t2_typ
                                 65.050003      35   2276.750107  r
ADHALFDL           umcl18u250t2_typ
                                 40.660000       4    162.639999  r
AND2D1             umcl18u250t2_typ
                                 16.260000      12    195.120003  
AND3D1             umcl18u250t2_typ
                                 20.330000       5    101.650000  
AO21D1             umcl18u250t2_typ
                                 28.459999       3     85.379997  
AOI22D1            umcl18u250t2_typ
                                 24.389999       9    219.509995  
DFERPQ1            umcl18u250t2_typ
                                101.639999      86   8741.039948  n
DFFRPQ1            umcl18u250t2_typ
                                 81.309998       4    325.239990  n
EXNOR2D1           umcl18u250t2_typ
                                 28.459999       5    142.299995  
EXNOR3D1           umcl18u250t2_typ
                                 52.849998       1     52.849998  
EXOR2D1            umcl18u250t2_typ
                                 28.459999      41   1166.859962  
INVD1              umcl18u250t2_typ
                                  8.130000      51    414.630006  
NAN2D1             umcl18u250t2_typ
                                 12.200000      19    231.799996  
NAN3D1             umcl18u250t2_typ
                                 16.260000       8    130.080002  
NAN3M1D1           umcl18u250t2_typ
                                 20.330000       1     20.330000  
NAN4D1             umcl18u250t2_typ
                                 20.330000       4     81.320000  
NOR2D1             umcl18u250t2_typ
                                 12.200000      21    256.199996  
NOR2M1D1           umcl18u250t2_typ
                                 16.260000       5     81.300001  
OAI21D1            umcl18u250t2_typ
                                 20.330000       6    121.980000  
OAI21M20D1         umcl18u250t2_typ
                                 24.389999      13    317.069992  
OAI22D1            umcl18u250t2_typ
                                 24.389999      26    634.139984  
OAI22M10D1         umcl18u250t2_typ
                                 32.520000      17    552.840008  
OAI32D1            umcl18u250t2_typ
                                 28.459999       3     85.379997  
OAI211D1           umcl18u250t2_typ
                                 24.389999       1     24.389999  
OR2D1              umcl18u250t2_typ
                                 16.260000       2     32.520000  
TIELO              umcl18u250t2_typ
                                  8.130000       1      8.130000  
-----------------------------------------------------------------------------
Total 26 references                                 16461.449976
1
dc_shell> dc_shell> Information: Updating design information... (UID-85)
 
****************************************
Report : timing
        -path full
        -delay max
        -max_paths 1
Design : sec_nov_std
Version: R-2020.09-SP2
Date   : Fri Mar  3 12:06:46 2023
****************************************

Operating Conditions: nom_pvt   Library: umcl18u250t2_typ
Wire Load Model Mode: top

  Startpoint: data_in(0) (input port clocked by clock)
  Endpoint: sec_nov_inst/arx_i1_reg_reg_0_
            (rising edge-triggered flip-flop clocked by clock)
  Path Group: clock
  Path Type: max

  Point                                                   Incr       Path
  --------------------------------------------------------------------------
  clock clock (rise edge)                                 0.00       0.00
  clock network delay (ideal)                             0.00       0.00
  input external delay                                    5.00       5.00 r
  data_in(0) (in)                                         0.00       5.00 r
  sec_nov_inst/arx_i1_reg_reg_0_/D (DFERPQ1)              0.00       5.00 r
  data arrival time                                                  5.00

  clock clock (rise edge)                                10.00      10.00
  clock network delay (ideal)                             0.00      10.00
  sec_nov_inst/arx_i1_reg_reg_0_/CK (DFERPQ1)             0.00      10.00 r
  library setup time                                     -0.11       9.89
  data required time                                                 9.89
  --------------------------------------------------------------------------
  data required time                                                 9.89
  data arrival time                                                 -5.00
  --------------------------------------------------------------------------
  slack (MET)                                                        4.89


1
dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> flat_rtl_none_10
dc_shell> dc_shell> dc_shell> Writing vhdl file '/home/s2981416/map/vhdl/synopsys_out/sec_nov_std_rtl_none_10_flat.vhd'.
1
dc_shell> dc_shell> dc_shell> Writing ddc file 'synopsys_out/sec_nov_std_rtl_none_10_flat.ddc'.
1
dc_shell> dc_shell> dc_shell> dc_shell> Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/s2981416/map/vhdl/synopsys_out/sec_nov_std_rtl_none_10_flat.sdf'. (WT-3)
1
dc_shell> 
Memory usage for this session 153 Mbytes.
Memory usage for this session including child processes 153 Mbytes.
CPU usage for this session 5 seconds ( 0.00 hours ).
Elapsed time for this session 7 seconds ( 0.00 hours ).

Thank you...
